app/controllers/actors_controller.rb

SELECT * FROM "actors" WHERE ("actors"."id" = 1)
---
  def show
    @actor = Actor.find(params[:id])

SELECT * FROM "actors" WHERE ("actors"."id" = 8)
DELETE FROM "actors" WHERE "id" = 8
---
  def destroy
	  @actors = Actor.find(params[:id])
	  @actors.destroy

INSERT INTO "actors" ("name", "created_at", "updated_at", "image", "biography") VALUES('Michał Górski', '2009-03-23 02:28:29', '2009-03-23 02:28:29', NULL, 'Bla bla.')
---
  def create
    @actor = Actor.new(params[:actor])

    respond_to do |format|
      if @actor.save