app/controllers/cinemas_controller.rb

  def index
    @cinemas = Cinema.all
---
SELECT * FROM "cinemas"

  def show
    @cinema = Cinema.find(params[:id])
---
SELECT * FROM "cinemas" WHERE ("cinemas"."id" = 1)

  def create
    @cinema = Cinema.new(params[:cinema])

    respond_to do |format|
      if @cinema.save
---
INSERT INTO "cinemas" ("name", "city", "updated_at", "created_at") VALUES('Krewetka', 'Gdańsk', '2009-03-24 12:27:08', '2009-03-24 12:27:08')

  def destroy
    @cinema = Cinema.find(params[:id])
    @cinema.destroy
---
SELECT * FROM "cinemas" WHERE ("cinemas"."id" = 1)
DELETE FROM "cinemas" WHERE "id" = 1