app/controllers/movies_controller.rb

SELECT * FROM "movies" WHERE ("movies"."id" = 4)
---
  def show
    @movie = Movie.find(params[:id])

INSERT INTO "movies" ("name", "updated_at", "description", "length", "image", "created_at") VALUES('Władca Pierścieni', '2009-03-24 12:34:04', 'Fantasy', 129, NULL, '2009-03-24 12:34:04')
---
  def create
    @movie = Movie.new(params[:movie])

    respond_to do |format|
      if @movie.save

SELECT * FROM "movies" WHERE ("movies"."id" = 8)
DELETE FROM "movies" WHERE "id" = 8
---
  def destroy
	      @movie = Movie.find(params[:id])
	          @movie.destroy