app/controllers/performances_controller.rb

SELECT * FROM "performances" WHERE (started_at > '2009-03-23 01:25:45')
---
  def index
    @performances = Performance.find(:all, :conditions => ["started_at > ?", Time.now])

SELECT * FROM "performances" WHERE ("performances"."id" = 1)
---
  def show
    @performance = Performance.find(params[:id])

INSERT INTO "performances" ("updated_at", "movie_id", "cinema_id", "started_at", "created_at") VALUES('2009-03-24 12:24:44', 1, 2, '2009-03-24 12:24:00', '2009-03-24 12:24:44')
---
  def create
    @performance = Performance.new(params[:performance])

    respond_to do |format|
      if @performance.save

SELECT * FROM "performances" WHERE ("performances"."id" = 8)
DELETE FROM "performances" WHERE "id" = 8
---
  def destroy
    @performance = Performance.find(params[:id])
    @performance.destroy